src/Documents/ВводОстатков/ВводОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>ВводОстатков</name>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСКассирами</registerRecords>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСАгенствами</registerRecords>
	<registerRecords>AccumulationRegister.ДвижениеДенежныхСредств</registerRecords>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ВидыВводаНачальныхОстатков</types>
		</type>
	</attributes>
	<tabularSections>
		<name>ОстатокПоКассе</name>
		<attributes>
			<name>Касса</name>
			<type>
				<types>CatalogRef.Касса</types>
			</type>
		</attributes>
		<attributes>
			<name>Сумма</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
	</tabularSections>
	<tabularSections>
		<name>ОстатокПоЗадолженности</name>
		<attributes>
			<name>Кассир</name>
			<type>
				<types>CatalogRef.Кассир</types>
			</type>
		</attributes>
		<attributes>
			<name>Сумма</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаВзаиморасчетов</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>Статус</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
	</tabularSections>
	<tabularSections>
		<name>ОстатокКредиторскойЗадолженности</name>
		<attributes>
			<name>Поставщик</name>
			<type>
				<types>CatalogRef.Агенство</types>
			</type>
		</attributes>
		<attributes>
			<name>Сумма</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Статус</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаВзаиморасчетов</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ВзаиморасчетыСКассирами/ВзаиморасчетыСКассирами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВзаиморасчетыСКассирами</name>
	<resources>
		<name>СуммаЗадолженности</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Субагент</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Организация</name>
		<type>
			<types>CatalogRef.Организация</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ДвижениеДенежныхСредств/ДвижениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ДвижениеДенежныхСредств</name>
	<resources>
		<name>Сумма</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>БанковскийСчетКасса</name>
		<type>
			<types>CatalogRef.Касса</types>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Покупатель</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Поставщик</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ХозяйственнаяОперация</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВзаиморасчетыСАгенствами/ВзаиморасчетыСАгенствами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВзаиморасчетыСАгенствами</name>
	<resources>
		<name>СуммаЗадолженностиАГН</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>10</precision>
			</numberQualifiers>
		</type>
	</resources>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</attributes>
	<dimensions>
		<name>Авиакомпания</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыВводаНачальныхОстатков/ВидыВводаНачальныхОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ВидыВводаНачальныхОстатков</name>
	<enumValues>
		<name>ОстатокПоКассаБанковскийСчет</name>
	</enumValues>
	<enumValues>
		<name>ЗадолженностьПередПоставщиками</name>
	</enumValues>
	<enumValues>
		<name>ЗадолженностьКассиров</name>
	</enumValues>
</mdclass:Enum>

src/Documents/ВводОстатков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ВидОперации=Перечисления.ВидыВводаНачальныхОстатков.ЗадолженностьКассиров Тогда
	#Область ОстаткиПоЗадолженности
	Движения.ВзаиморасчетыСКассирами.Записывать=Истина;
	Для каждого СтрТаб из ОстатокПоЗадолженности Цикл
	Движение=Движения.ВзаиморасчетыСКассирами.Добавить();
	Движение.ВалютаВзаиморасчетов=СтрТаб.ВалютаВзаиморасчетов;
	Движение.Организация=Справочники.Организация.ОсновнаяОрганизация;
	Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
	Движение.Субагент=СтрТаб.Кассир;
	Движение.СуммаЗадолженности=СтрТаб.Сумма;
	Движение.Период=Дата;
	КонецЦикла;
	#КонецОбласти
	ИначеЕсли ВидОперации=Перечисления.ВидыВводаНачальныхОстатков.ОстатокПоКассаБанковскийСчет Тогда
	#Область ОстаткиПоКассам
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	Для каждого СтрТаб из ОстатокПоКассе Цикл;
	Движение=Движения.ДвижениеДенежныхСредств.Добавить();
	Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
	Движение.БанковскийСчетКасса=СтрТаб.Касса;
	Движение.ВалютаВзаиморасчетов=СтрТаб.Касса.ВалютаВзаиморасчетов;
	Движение.Период=Дата;
	Движение.Сумма=СтрТаб.Сумма;
	КонецЦикла;
	#КонецОбласти
	ИначеЕсли ВидОперации=Перечисления.ВидыВводаНачальныхОстатков.ЗадолженностьПередПоставщиками Тогда
	#Область ОстаткиПередПоставщиками
	Движения.ВзаиморасчетыСАгенствами.Записывать=Истина;
	Для каждого СтрТаб из ОстатокКредиторскойЗадолженности Цикл
	Движение=Движения.ВзаиморасчетыСАгенствами.Добавить();
	Движение.Авиакомпания=СтрТаб.Поставщик;
	Если СтрТаб.Сумма>0 Тогда
	Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
Иначе
	Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
	КонецЕсли;
	Движение.Период=Дата;
	Движение.СуммаЗадолженностиАГН=СтрТаб.Сумма;
	КонецЦикла;
	#КонецОбласти
	КонецЕсли;
КонецПроцедуры
